'use strict';

// Подписи элементов интерфейса

const btn_start_stop_caption = {
  // Надписи на кнопках "Старт/Стоп"
  // Редактируются правые значения
  'start': '▶ Старт',
  'stop': '◼ Стоп'
};

const color_for_message = {
  // Обращение к игроку по цвету для сообщения о пройденном временном отрезке
  'red': 'Красные',
  'blue': 'Синие'
};

const 
  caption_btn_break = 'Перерыв',
  caption_btn_warmup = 'Разминка';

const team_default = {
  // Названия команд по умолчанию.
  // Выводятся на табло в левом верхнем углу красного бокса
  // и в правом верхнем углу синего бокса.
  // Редактируются правые значения
  'red': 'Красные',
  'blue': 'Синие'
};

// Глобальные переменные, некоторые из них можно изменить в настройках

var end_count = 4; // Кол-во эндов. Меняется при старте нового матча
var time_one_end = 3.5 * 60 * 1000; // Игровое время для каждого игрока на один энд в милисекундах
var time_break = 1 * 60 * 1000; // Время перерыва между эндами
var time_warmup = 1.5 * 60 * 1000; // Время предыгровой разминки

// ФУНКЦИИ

// Конвертерует код сообщения в текст
function code_to_message(code, color) {
  switch (code) {
    case 0:
      return `${color_for_message[color]}, одна минута`;
    case 1:
      return `${color_for_message[color]}, 30 секунд`;
    case 2:
      return `${color_for_message[color]}, время вышло`;
    case 10:
      return 'Предыгровая разминка';
    case 11:
      return 'Перерыв между эндами';
  }
} /* function code_to__message(code, color) */
